app/services/create_admin_service.rb

  def call
    User.find_or_create_by!(email: Rails.application.secrets.admin_email) do |u|
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user@example.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "confirmed_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"